vvpai9/Keil/Keil_v5/ARM/Pack/.Web/TexasInstruments.MSPM0GX51X_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>TexasInstruments</vendor>
    <name>MSPM0GX51X_DFP</name>
    <description>Device Family Pack for Texas Instruments MSPM0GX51X Series</description>
    <url>https://software-dl.ti.com/msp430/esd/MSPM0-CMSIS/MSPM0GX51X/latest/exports/</url>
    <supportContact>https://e2e.ti.com/support/microcontrollers/</supportContact>
    <license>01_Pack/license.txt</license>

    <releases>
        <release version="1.0.0" date="2024-08-26">
        Initial release of MSPM0GX51X series device familiy pack.
        New device support:
            * MSPM0G351X
            * MSPM0G151X
        </release>
    </releases>

    <keywords>
        <!-- keywords for indexing -->
        <keyword>Texas Instruments</keyword>
        <keyword>MSPM0</keyword>
        <keyword>MSPM0G</keyword>
        <keyword>MSPM0GXX</keyword>
        <keyword>MSPM0G351X</keyword>
        <keyword>MSPM0G151X</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Texas Instruments</keyword>
      </keywords>
  
    <!-- devices section (mandatory for Device Family Packs) -->
    <devices>
        <family Dfamily="MSPM0GX51X Series" Dvendor="Texas Instruments:16">
            <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dclock="80000000" Dmpu="MPU" Dendian="Little-endian"/>
            <debugconfig default="swd" clock="5000000" swj="1"/>
            <book name="https://developer.arm.com/documentation/dui0662/latest/" title="Cortex-M0+ Generic User Guide"/>
            <description>
The MSPM0G3xxx and MSPM0G1xxx microcontrollers (MCUs) are part of MSP's
highly-integrated, low-power 32-bit MCU family based on the enhanced Arm®
Cortex®-M0+ 32-bit core platform operating at up to 80-MHz frequency.

These cost-optimized MCUs offer high-performance analog peripheral integration,
support extended temperature ranges from -40°C to 125°C, and operate with supply
voltages ranging from 1.62V to 3.6V.

The MSPM0G351X devices provide up to 128 KB embedded Flash program memory
with built-in error correction code (ECC) and up to 32 KB SRAM with
hardware parity option. They also incorporate a memory protection unit,
7-channel DMA, math accelerator, and a variety of high-performance analog
peripherals such as two 12-bit 4MSPS ADCs, configurable internal shared
voltage reference, one 12-bit 1MSPS DAC, three high speed comparators
with built-in reference DACs, two zero-drift, zero-crossover op-amps
with programmable gain, and one general-purpose amplifier.

These devices also offer intelligent digital peripherals suchas three
16-bit advanced control timers, three 16-bit general purpose timers,
one 24-bit high resolution timer, two windowed-watchdog timers,
and one RTC with alarm and calendar mode.

These devices provide
data integrity and encryption peripherals (AES, CRC, TRNG) and enhanced
communication interfaces (four UART, two I2C, two SPI, CAN 2.0/FD).
            </description>
            <debug>
                <!-- Patched ROM Table for a Cortex-M0+ -->
                <datapatch  type="AP" __dp="0" __ap="0" address="0xF8" value="0xF0000003" info="AP BASE Register, ROM Table at 0xF0000002"/>
            </debug>
            <!-- debug sequences -->  
            <sequences>
                <sequence name="DebugPortSetup">
                    <block>
                        __var isSWJ      = ((__protocol &amp; 0x00010000) != 0);
                        __var hasDormant = __protocol &amp; 0x00020000;
                        __var protType   = __protocol &amp; 0x0000FFFF;
                    </block>
                    <!-- JTAG Protocol -->
                    <control if="protType == 1">
                        <control if="isSWJ">
                            <control if="hasDormant">
                                <block atomic="1">
                                    // Ensure current debug interface is in reset state
                                    DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                                    // Select Dormant State (from SWD)
                                    DAP_SWJ_Sequence(16, 0xE3BC);                            
                                    // At least 8 cycles SWDIO/TMS HIGH
                                    DAP_SWJ_Sequence(8, 0xFF);                            
                                    // Alert Sequence Bits  0.. 63
                                    DAP_SWJ_Sequence(64, 0x86852D956209F392);                            
                                    // Alert Sequence Bits 64..127
                                    DAP_SWJ_Sequence(64, 0x19BC0EA2E3DDAFE9);
                                    // 4 cycles SWDIO/TMS LOW + 8-Bit JTAG Activation Code (0x0A)            
                                    DAP_SWJ_Sequence(12, 0x0A0);
                                    // Ensure JTAG interface is reset
                                    DAP_SWJ_Sequence(6, 0x3F);
                                </block>
                            </control>
                            <control if="!hasDormant">                    
                                <block atomic="1">
                                // Ensure current debug interface is in reset state
                                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);                            
                                // Execute SWJ-DP Switch Sequence SWD to JTAG (0xE73C)
                                // Change if SWJ-DP uses deprecated switch code (0xAEAE)
                                DAP_SWJ_Sequence(16, 0xE73C);                            
                                // Ensure JTAG interface is reset
                                DAP_SWJ_Sequence(6, 0x3F);
                                </block>                    
                            </control>                    
                        </control>
                            <block atomic="1">
                                // JTAG "Soft" Reset
                                DAP_JTAG_Sequence(6, 1, 0x3F);
                                DAP_JTAG_Sequence(1, 0, 0x01);
                            </block>
                    </control>

                    <!-- SWD Protocol -->
                    <control if="protType == 2">
                        <control if="isSWJ">
                            <control if="hasDormant">
                                <block atomic="1">
                                    // Ensure current debug interface is in reset state
                                    DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);                            
                                    // Select Dormant State (from JTAG)
                                    DAP_SWJ_Sequence(31, 0x33BBBBBA);                            
                                    // At least 8 cycles SWDIO/TMS HIGH
                                    DAP_SWJ_Sequence(8, 0xFF);                            
                                    // Alert Sequence Bits  0.. 63
                                    DAP_SWJ_Sequence(64, 0x86852D956209F392);                            
                                    // Alert Sequence Bits 64..127
                                    DAP_SWJ_Sequence(64, 0x19BC0EA2E3DDAFE9);
                                    // 4 cycles SWDIO/TMS LOW + 8-Bit SWD Activation Code (0x1A)            
                                    DAP_SWJ_Sequence(12, 0x1A0);
                                    // Enter SWD Line Reset State
                                    DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  // &gt; 50 cycles SWDIO/TMS High
                                    DAP_SWJ_Sequence(3,  0x00);                // At least 2 idle cycles (SWDIO/TMS Low)
                                </block>
                            </control>
                            <control if="!hasDormant">
                                <block>
                                    // Ensure current debug interface is in reset state
                                    DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF); //lets put the JTAG line in a reset state
                                    DAP_SWJ_Sequence(16,0xE73C); //SWD to JTAG, this is to ensure the state machine is initialized
                                    DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF); //Put it back in reset
                                    DAP_SWJ_Sequence(16, 0xE79E); //JTAG to SWD switch
                                    DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  //Ensure the switch is successful 
                                    DAP_SWJ_Sequence(7,  0x00); //Give the line some time to initialize
                                </block>
                            </control>
                        </control>
                        <control if="!isSWJ">
                            <control if="hasDormant">
                                <block atomic="1">
                                // Ensure current debug interface is in reset state
                                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                                
                                // At least 8 cycles SWDIO/TMS HIGH
                                DAP_SWJ_Sequence(8, 0xFF);
                                
                                // Alert Sequence Bits  0.. 63
                                DAP_SWJ_Sequence(64, 0x86852D956209F392);
                                
                                // Alert Sequence Bits 64..127
                                DAP_SWJ_Sequence(64, 0x19BC0EA2E3DDAFE9);
                        
                                // 4 cycles SWDIO/TMS LOW + 8-Bit SWD Activation Code (0x1A)            
                                DAP_SWJ_Sequence(12, 0x1A0);
                                
                                // Enter SWD Line Reset State
                                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  // &gt; 50 cycles SWDIO/TMS High
                                DAP_SWJ_Sequence(3,  0x00);                // At least 2 idle cycles (SWDIO/TMS Low)
                                </block>
                            </control>
                            <control if="!hasDormant">
                                <block atomic="1">
                                // Enter SWD Line Reset State
                                DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  // &gt; 50 cycles SWDIO/TMS High
                                DAP_SWJ_Sequence(3,  0x00);                // At least 2 idle cycles (SWDIO/TMS Low)
                                </block>
                            </control>
                        </control>
                        <block>
                            // Read DPIDR to enable SWD interface (SW-DPv1 and SW-DPv2)
                            ReadDP(0x0);
                        </block>
                    </control>
                </sequence>
                <sequence name="DebugPortStart">

                    <block>
                        __var SW_DP_ABORT       = 0x0;
                        __var DP_CTRL_STAT      = 0x4;
                        __var DP_SELECT         = 0x8;
                        __var powered_down      = 0;

                        //Beyond here do not modify
                        // Switch to DP Register Bank 0
                        WriteDP(DP_SELECT, 0x00000000);

                        // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
                        powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
                    </block>
                    <control if="powered_down">
                        <block>
                            // Request Debug/System Power-Up
                            Message(0, "Debug/System power-up request sent");
                            WriteDP(DP_CTRL_STAT, 0x50000000);
                        </block>
                        
                        <!-- Wait for Power-Up Request to be acknowledged -->
                        <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
                        
                        <!-- JTAG Specific Part of sequence -->
                        <control if="(__protocol &amp; 0xFFFF) == 1">
                        
                            <block>
                                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                                // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                                WriteDP(DP_CTRL_STAT, 0x50000F32);
                            </block>
                        
                        </control>
                        
                        <!-- SWD Specific Part of sequence -->
                        <control if="(__protocol &amp; 0xFFFF) == 2">
                            <block>
                                Message(0, "executing SWD power up");
                                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                                WriteDP(DP_CTRL_STAT, 0x50000F00);
                                
                                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                                WriteDP(SW_DP_ABORT, 0x0000001E);
                            </block>
                        </control>
                    </control>
                    <block>
                        __var DEBUG_PORT_VAL    = 0;
                        __var ACCESS_POINT_VAL  = 0;

                        __ap = 1; 
                        WriteAP(0x0C, 0x04); //lets use the mini pwr-ap as backup
                        
