vvpai9/Keil/Keil_v5/ARM/Pack/.Web/TexasInstruments.MSPM0GX51X_DFP.pdsc
                        __ap = 4;
                        ACCESS_POINT_VAL = ReadAP(0x00);//Reading current state of access point
                        Message(0, "Current state of access point is: %x",ACCESS_POINT_VAL);
                    </block>            
                        <block>
                        __var nReset = 0x80;
                        __var canReadPins = 0;
                        // De-assert nRESET line to activate the hardware reset
                        canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
                        </block>
                        <!-- Keep reset active for 50 ms -->
                        <control while="1" timeout="200"/>
                        <control if="canReadPins">
                            <!-- Assert nRESET line and wait max. 1s for recovery -->
                            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
                        </control>
                        <control if="!canReadPins">
                            <block>
                            // Assert nRESET line
                            DAP_SWJ_Pins(nReset, nReset, 0);
                            </block>
                            <!-- Wait 100ms for recovery if nRESET not readable -->
                            <control while="1" timeout="100000"/>
                        </control>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) == 0">
                        <block>
                            WriteAP(0x00, 0x190008);
                            WriteAP(0xF0, 0x01);
                        </block> 
                    </control>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) != 0">
                        <block>
                            WriteAP(0xF0, 0x01);
                            WriteAP(0x00, 0xF90008);
                            WriteAP(0xF0, 0x01);
                        </block>
                    </control>
                    <block>
                        ACCESS_POINT_VAL = ReadAP(0x00);//Reading current state of access point
                        Message(0, "Current state of access point is: %x",ACCESS_POINT_VAL);
                        __ap = 0; //lets make sure we reset the access point selection
                    </block>
                </sequence>
                <sequence name="DebugDeviceUnlock">
                    <block>
                        __ap = 1;
                        __var deviceID = 0;
                        __var version = 0;
                        __var partNum = 0;
                        __var manuf = 0;
                        __var isMSPM0GX51X = 0;
                        __var isProduction = 0;
                        __var continueId = 0;
                        deviceID =   ReadAP(0x00);
                        version = deviceID >> 28;
                        partNum = (deviceID &amp; 0x0FFFF000) >> 12;
                        manuf = (deviceID &amp; 0x00000FFE) >> 1;
                        isMSPM0GX51X = (partNum == 0xBBA9) &amp;&amp; (manuf == 0x17);
                        isProduction = (version &gt; 0);
                    </block>
                    <!-- Check if device ID is correct -->
                    <control if="!isMSPM0GX51X">
                        <block>
                            continueId = Query(1, "Incorrect ID. This support package is for MSPM0GX51X devices. Continue?", 4);
                        </block>
                    </control>
                    <control if="continueId == 4">
                        <block>
                            Message(2, "Invalid ID");
                        </block>
                    </control>
                </sequence>
            </sequences>
            <!-- features common for the whole family -->
            <feature type="NVIC" n="32" name="Nested Vectored Interrupt Controller (NVIC)"/>
            <feature type="DMA" n="12" name="Direct Memory Access (DMA)"/>
            <feature type="MemoryOther" name="Up to 512KB Flash memory with built-in error correction code (ECC)"/>
            <feature type="MemoryOther" name="Up to 128KB SRAM with hardware parity"/>
            <feature type="XTAL" n="4000000" m="48000000" name="High Frequency crystal (HFXT)"/>
            <feature type="PLL" n="1" name="Internal PLL"/>
            <feature type="RTC" n="32768" name="Internal RTC with alarm and calendar modes"/>
            <feature type="ClockOther" name="Internal 4-32MHz oscillator with +-1% accuracy (SYSOSC)"/>
            <feature type="ClockOther" name="Internal 32kHz oscillator (LFOSC)"/>
            <feature type="ClockOther" name="Low Frequency 32kHz crystal (LFXT)"/>
            <feature type="PowerMode" n="12" name="RUN0, RUN1, RUN2, SLEEP0, SLEEP1, SLEEP2, STOP0, STOP1, STOP2, STANDBY0, STANDBY1, SHUTDOWN"/>
            <feature type="VCC" n="1.62" m="3.6"/>
            <feature type="Temp" n="-40" m="125" name="Extended Operating Temperature Range"/>
            <feature type="DAC" n="1" m="12" name="1MSPS digital-to-analog converter with integrated output buffer (DAC)"/>
            <feature type="AnalogOther" n="1" name="General-purpose amplifier (GPAMP)"/>
            <feature type="AnalogOther" n="3" name="High-speed comparator (COMP) with 8-bit reference DACs"/>
            <feature type="AnalogOther" n="1" name="Configurable 1.4V or 2.5V internal shared voltage reference (VREF)"/>
            <feature type="Timer" n="26" m="16" name="Nine 16-bit advanced timers with deadband supporting up to 26 PWM channels"/>
            <feature type="TimerOther" n="3" name="16-bit general purpose timer"/>
            <feature type="TimerOther" n="2" name="16-bit general purpose timer supporting QEI"/>
            <feature type="TimerOther" n="1" name="16-bit general purpose timer supporting low power operation in STANDBY mode"/>
            <feature type="TimerOther" n="1" name="32-bit high resolution timer"/>
            <feature type="TimerOther" n="2" name="16-bit advanced timers with deadband support up to 12 PWM channels"/>
            <feature type="WDT" n="3" name="Two Window-watchdog timer (WWDT), one independent watchdog timer (IWDT)"/>
            <feature type="I2C" n="3" name="I2C interface supporting up to FM+ (1Mbps), SMBus/PMBus, and wakeup from STOP mode"/>
            <feature type="SPI" n="3" m="32000000" name="SPI interface"/>
            <feature type="UART" n="7" name="UART inteface, two supporting LIN, IrDA, DALI, Smart Card, Manchester, and five supporting low-power operation in STANDBY mode"/>
            <feature type="Other" n="1" name="Math accelerator supporting DIV, SQRT, and TRIG computations"/>
            <feature type="Crypto" n="128.256" name="HW accelerated AES Encryption/Decryption Engine"/>
            <feature type="RNG" n="1" name="True Random Number generator (TRNG)"/>
            <feature type="ADC" n="27" m="12" name="Two simultaneous 4MSPS analog-to-digital converters (ADC)"/>
            <feature type="IOs" n="93" name="General purpose I/Os, including two 5-V tolerant, two high-drive with 20mA driver strength"/>
<!-- ************************  Subfamily MSPM0G351X  **************************** -->
            <subFamily DsubFamily="MSPM0G351X">
                <feature type="CAN" n="2" name="Controller Area Network (CAN) interface supporting CAN 2.0 A or B and CAN-FD"/>
                <!-- *************************  Device MSPM0G3519  ***************************** -->
                <device Dname="MSPM0G3519">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00080000" startup="1" default="1"/>
                    <memory     name="IROM2" access="rx"  start="0x00400000" size="0x00080000" default="0" alias="IROM1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00010000" default="0"/>
                    <memory     name="IRAM_Parity" access="rwx" start="0x20100000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="IRAM_No_Parity" access="rwx" start="0x20200000" size="0x00020000" default="1" alias="IRAM1"/>
                    <memory     name="IRAM_Parity_Code" access="rwx" start="0x20300000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="NonMain_ECC" access="r"  start="0x41C00000" size="0x00000800" default="1"/>
                    <memory     name="Factory_ECC" access="r"  start="0x41C40000" size="0x00000200" default="1"/>
                    <memory     name="Data" access="r"  start="0x41D00000" size="0x00004000" default="1"/>
                    <compile    define="__MSPM0G3519__"/>
                    <debug      svd="03_SVD/MSPM0G351X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_MAIN_512KB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20200000" RAMsize="0x00020000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_NONMAIN.FLM" start="0x41C00000" size="0x00000800" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_DATA_16KB.FLM" start="0x41D00000" size="0x00004000" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                </device>
                <!-- *************************  Device MSPM0G3518  ***************************** -->
                <device Dname="MSPM0G3518">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00040000" startup="1" default="1"/>
                    <memory     name="IROM2" access="rx"  start="0x00400000" size="0x00040000" default="0" alias="IROM1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00010000" default="0"/>
                    <memory     name="IRAM_Parity" access="rwx" start="0x20100000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="IRAM_No_Parity" access="rwx" start="0x20200000" size="0x00020000" default="1" alias="IRAM1"/>
                    <memory     name="IRAM_Parity_Code" access="rwx" start="0x20300000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="NonMain_ECC" access="r"  start="0x41C00000" size="0x00000800" default="1"/>
                    <memory     name="Factory_ECC" access="r"  start="0x41C40000" size="0x00000200" default="1"/>
                    <memory     name="Data" access="r"  start="0x41D00000" size="0x00004000" default="1"/>
                    <compile    define="__MSPM0G3518__"/>
                    <debug      svd="03_SVD/MSPM0G351X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_MAIN_256KB.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20200000" RAMsize="0x00020000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_NONMAIN.FLM" start="0x41C00000" size="0x00000800" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_DATA_16KB.FLM" start="0x41D00000" size="0x00004000" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                </device>
            </subFamily>
<!-- ************************  Subfamily MSPM0G151X  **************************** -->
            <subFamily DsubFamily="MSPM0G151X">
                <!-- *************************  Device MSPM0G1519  ***************************** -->
                <device Dname="MSPM0G1519">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00080000" startup="1" default="1"/>
                    <memory     name="IROM2" access="rx"  start="0x00400000" size="0x00080000" default="0" alias="IROM1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00010000" default="0"/>
                    <memory     name="IRAM_Parity" access="rwx" start="0x20100000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="IRAM_No_Parity" access="rwx" start="0x20200000" size="0x00020000" default="1" alias="IRAM1"/>
                    <memory     name="IRAM_Parity_Code" access="rwx" start="0x20300000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="NonMain_ECC" access="r"  start="0x41C00000" size="0x00000800" default="1"/>
                    <memory     name="Factory_ECC" access="r"  start="0x41C40000" size="0x00000200" default="1"/>
                    <memory     name="Data" access="r"  start="0x41D00000" size="0x00004000" default="1"/>
                    <compile    define="__MSPM0G1519__"/>
                    <debug      svd="03_SVD/MSPM0G151X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_MAIN_512KB.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20200000" RAMsize="0x00020000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_NONMAIN.FLM" start="0x41C00000" size="0x00000800" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_DATA_16KB.FLM" start="0x41D00000" size="0x00004000" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                </device>
