vvpai9/Keil/Keil_v5/ARM/Pack/.Web/TexasInstruments.MSPM0GX51X_DFP.pdsc
                <!-- *************************  Device MSPM0G1518  ***************************** -->
                <device Dname="MSPM0G1518">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00040000" startup="1" default="1"/>
                    <memory     name="IROM2" access="rx"  start="0x00400000" size="0x00040000" default="0" alias="IROM1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00010000" default="0"/>
                    <memory     name="IRAM_Parity" access="rwx" start="0x20100000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="IRAM_No_Parity" access="rwx" start="0x20200000" size="0x00020000" default="1" alias="IRAM1"/>
                    <memory     name="IRAM_Parity_Code" access="rwx" start="0x20300000" size="0x00010000" default="0" alias="IRAM1"/>
                    <memory     name="NonMain_ECC" access="r"  start="0x41C00000" size="0x00000800" default="1"/>
                    <memory     name="Factory_ECC" access="r"  start="0x41C40000" size="0x00000200" default="1"/>
                    <memory     name="Data" access="r"  start="0x41D00000" size="0x00004000" default="1"/>
                    <compile    define="__MSPM0G1518__"/>
                    <debug      svd="03_SVD/MSPM0G151X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_MAIN_256KB.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20200000" RAMsize="0x00020000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_NONMAIN.FLM" start="0x41C00000" size="0x00000800" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0GX51X_DATA_16KB.FLM" start="0x41D00000" size="0x00004000" RAMstart="0x20200000" RAMsize="0x00020000" default="0"/>
                </device>
            </subFamily>
        </family>
    </devices>

    <boards>
        <board vendor="TexasInstruments" name="LP-MSPM0G3519" salesContact="http://www.ti.com/general/docs/contact.tsp">
            <description>MSPM0G3519 LaunchPad</description>
            <mountedDevice    deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSPM0G3519"/>
            <compatibleDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dfamily="MSPM0GX51X Series" DsubFamily="MSPM0G351X"/> 
            <debugInterface adapter="XDS110-ET" connector="XDS110-ET Onboard Emulator"/>  
            <debugInterface adapter="SWD" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
            <feature type="USB" n="1" name="USB Device,  Micro-B receptacle"/>
            <feature type="Button" n="3" name="reset and two user push-buttons"/>
            <feature type="LED" n="4" name="LEDs for user interaction, including 1 RGB LED"/> 
            <feature type="ConnOther" n="4" name="2x40 pin BoosterPack Connector and support for 20 pin BoosterPacks"/>
            <feature type="TempSens" n="1" name="Temperature sensor circuit"/>
            <feature type="LightSens" n="1" name="Light sensor circuit"/>
            <feature type="SensOther" n="1" name="External OPA2365 for 4MSPS ADC evaluation"/>
            <feature type="XTAL" n="48000000"/>
            <feature type="Other" name="EnergyTrace technology available for ultra-low-power debugging"/>
            <feature type="Other" name="32kHz crystal"/>
        </board>
    </boards>

</package>
